import { Injectable } from '@angular/core';
import { News } from '../models/news';
import { Menu } from '../models/menu';
import { HttpClient } from '@angular/common/http';
import { Observable, of } from 'rxjs';
import { catchError, map, tap } from 'rxjs/operators';
import { MessageService } from '../message.service';



@Injectable({
  providedIn: 'root'
})
export class MainPageService {

  menu: Menu[] = [
    { id: 1, name: 'Головна', link: 'main' },
    { id: 2, name: 'Новини', link: 'news' },
    { id: 3, name: 'Про нас', link: '#' },
    { id: 4, name: 'Мій кабінет', link: 'admin' },
  ];

  company = {
    name: 'Мій дім',
    title: 'Ми керуюча компанія',
    subtitle: 'Компанія «Мій дім» заснована 2 вересня 2016 року з метою створення прикладу якісного професійного обслуговування багатоквартирного будинку на максимально прозорою і оптимізованої основі.',
    tagline : '«Якщо Ви вважаєте, що компетентність коштує дорого, то спробуйте некомпетентність - вона обійдеться вам набагато дорожче» - Йохан Стаель фон Хольстайн',
    aboutUsFirst: 'Компанія «Мій дім» працює виключно з ОСББ, так як механізм ОСББ дозволяє максимально прозоро розподіляти внески співвласників на управління будинком, а також сформувати відповідальне ставлення до своєї власності. Якщо у Вашому будинку ще не створено ОСББ - наші фахівці безкоштовно проконсультують Вашу ініціативну групу в його створенні і здійсненні всіх необхідних подальших дій після його реєстрації. Для укладення договору на комплексне обслуговування, ОСББ необхідно: 1) узгодити з нами калькуляцію внесків на управління будинком; 2) провести загальні збори з винесенням позитивного рішення з питання укладення договору; 3) на загальних зборах прийняти ряд супутніх питань, необхідних для максимально ефективної роботи ОСББ.',
    aboutUsSecond: 'Контроль за нашою роботою слід розглядати крізь призму взаємодії з співвласниками, а саме: З Правлінням ОСББ наша команда взаємодіє безперервно шляхом присутності на зборах правління і зустрічей за потребою для обговорення тих питань, що належать до повноважень Правління відповідно до Статуту Вашого ОСББ. Для взаємодії з усіма співвласниками будинку з питань усунення аварійних ситуацій, для виклику фахівців, а також для скарг і пропозицій працює диспетчерська служба. Для ліквідації критичних ситуацій і забезпечення безпеки наших мешканців функціонує цілодобова аварійна служба. З питань бухгалтерії, довідок, проведення звірок з платежів у нас працює бухгалтерська служба. Телефони цих служб вказані на дошках оголошень в кожному під\'їзді нашого будинку і на нашому сайті. Керівництво «Мій дім» на запрошення присутній на всіх загальних зборах співвласників.',
    aboutUsThird: 'Cпіввласники залишають за собою право прийняття рішень в ОСББ, безпосередньо або через Статутні органи, контролюючи власні кошти у вигляді внесків на управління будинком і ін. Ми одночасно є як одним з підрядників надають послуги ОСББ, так і підконтрольним ОСББ кваліфікованим консультативним органом, який спрямований на: - ефективність роботи ОСББ; - мінімізацію можливих помилок з боку Правління ОСББ, Співвласники Вашого багатоквартирного будинку завжди знають, що Правління ОСББ приймає рішення, попередньо проконсультувавшись з фахівцями.'
  }

  constructor(
    private http: HttpClient,
    private messageService: MessageService) { }

  getMenu() {
    return this.menu;
  }

  getNews(): Observable<News[]> {
    return this.http.get<News[]>('http://localhost:3000/')
      .pipe(
        // tap(_ => this.log('fetched news')),
        catchError(this.handleError<News[]>('getNews', []))
      );
  };


  private handleError<T>(operation = 'operation', result?: T) {
    return (error: any): Observable<T> => {

      // TODO: send the error to remote logging infrastructure
      console.error(error); // log to console instead

      // TODO: better job of transforming error for user consumption
      this.log(`${operation} failed: ${error.message}`);

      // Let the app keep running by returning an empty result.
      return of(result as T);
    };
  }

  /** Log a HeroService message with the MessageService */
  private log(message: string) {
    this.messageService.add(`HeroService: ${message}`);
  }
}
